app/controllers/doctors/patients_controller.rb

SELECT COUNT(*) AS "count_all", DATE(created_at) AS "date_created_at" FROM "patients" GROUP BY DATE(created_at)
SELECT "patients"."created_at" FROM "patients"
---
  def registration_graph
    registration_data = Patient.group("DATE(created_at)").count
    @registration_data = {}

    registration_data.each do |date, count|