app/controllers/patients_controller.rb

  def create
    @patient = Patient.new(patient_params)
    @patient.user = current_user # Set the user for the patient

    if @patient.save
---
INSERT INTO "patients" ("name", "email", "phone", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "rajuSingh"], ["email", "singhyuvi973@gmail.com"], ["phone", "+918953662135"], ["created_at", "2023-09-07 10:03:02.330494"], ["updated_at", "2023-09-07 10:03:02.330494"], ["user_id", 7]]

  def update
    @patient = Patient.find(params[:id])

    if @patient.update(patient_params)
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
UPDATE "patients" SET "name" = $1, "updated_at" = $2 WHERE "patients"."id" = $3  [["name", "shubham Singh"], ["updated_at", "2023-09-07 16:54:25.558975"], ["id", 26]]

  def destroy
    @patient = Patient.find(params[:id])
    @patient.destroy
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
DELETE FROM "patients" WHERE "patients"."id" = $1  [["id", 27]]